src/DataProcessors/ИС_МП_ЮнитЭкономика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_МП_ЮнитЭкономика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры25</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаЦО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИС_WB_РазмерыНоменклатур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_WB_РазмерыНоменклатур</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИС_WB_Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>techSize</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>wbSize</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИС_WB_Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_WB_Номенклатура</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>createdAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imtID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>object</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Категории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>updateAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>vendorCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборачиваемость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ВБ_ТипыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>length</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>width</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>height</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректностьГабаритов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nmUUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>needKiz</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>weightBrutto</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_WB_ХарактеристикиКатегорий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтроковое</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МедиаФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХарактеристикиНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ИС_МП_ЮнитЭкономика/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

//+ ИнфоСофт Мурсалимов Д.Р. 30.01.25 УА #67818
&НаКлиенте
Перем ПоследняяСтраница; //- ИнфоСофт Мурсалимов Д.Р. 30.01.25 УА #67818

#КонецОбласти

#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//УстановитьУсловноеОформление();
	ИС_MP_Сервер.ПриСозданииНаСервере(ЭтотОбъект);	
	Маркетплейс = "WildBerries";
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	
	#Если ВебКлиент Тогда                         
		ПодключитьРасширениеДляРаботыСФайлами(Истина);
	#КонецЕсли
	
	//УправлениеФормой();
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	//Если Не ЗначениеЗаполнено(Профиль) Тогда
	//	Возврат;	
	//КонецЕсли;
	//
	//ПолучитьИЗаполнитьФункциональныеОпцииЦен(Профиль);
	//ОбновитьСписокНаСервере();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//Если Модифицированность Тогда

	//	Отказ = Истина;

	//	Если ЗавершениеРаботы Тогда
	//		ТекстПредупреждения = НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'");
	//		Возврат;
	//	КонецЕсли;		
	//	
	//	Оповещение = Новый ОписаниеОповещения("НесохраненныеИзмененияЗавершение", 
	//		ЭтотОбъект, Новый Структура("Закрытие", Истина));
	//	
	//	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
	//		НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'"), 
	//		РежимДиалогаВопрос.ДаНет);
	//
	//КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	
	//Если ЗначениеЗаполнено(Профиль) Тогда
	//
	//	ПолучитьИЗаполнитьФункциональныеОпцииЦен(Профиль);
	//	ЗаполнитьШапку();
	//	
	//	ВидыЦен = ПолучитьМассивВидовЦен(Маркетплейс);
	//	
	//	Если ВидыЦен.Количество() > 0 Тогда
	//		ОбновитьСписокНаСервере();
	//		УстановитьВидимостьПолученияЦен();
	//		Возврат;
	//	КонецЕсли;
	//			
	//КонецЕсли;
	//
	//ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Очистить();
	//Элементы.ВыгрузитьЦены.Доступность = Ложь;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #67818
&НаКлиенте
Процедура WildBerriesТаблицаДанныхКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.WildBerriesТаблицаДанных.ТекущиеДанные;
	
	РасчетПоказетелейСтрокиНаКлиенте(ТекущаяСтрока);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #67818 

//+ ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #67818
&НаКлиенте
Процедура WildBerriesТаблицаДанныхЦенаПередачиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.WildBerriesТаблицаДанных.ТекущиеДанные;
	
	РасчетПоказетелейСтрокиНаКлиенте(ТекущаяСтрока);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #67818
&НаКлиенте
Процедура WildBerriesТаблицаДанныхПрочиеРасходыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.WildBerriesТаблицаДанных.ТекущиеДанные;
	
	РасчетПоказетелейСтрокиНаКлиенте(ТекущаяСтрока);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130
&НаКлиенте
Процедура WildBerriesТаблицаДанныхЗакупочнаяЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.WildBerriesТаблицаДанных.ТекущиеДанные;
	
	РасчетПоказетелейСтрокиНаКлиенте(ТекущаяСтрока);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
&НаКлиенте
Процедура ЗагрузитьДанныеОК(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран период загрузки.", , , "ПериодДляЗагрузки");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьОтчетКомисисонераПоApiНаСервере();
	
	РасчетСреднейВзвешеннойЦеныНаСервере();
	
	СгруппироватьДанныеНаСервере();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
&НаКлиенте
Процедура ЗагрузитьДанныеХранения(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран период загрузки.", , , "ПериодДляЗагрузки");
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗагрузитьДанныеХраненияНаСервере(Профиль, Период, УникальныйИдентификатор);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьДанныеХраненияЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
	
	Элементы[Маркетплейс + "КартинкаОжидание"].Видимость 			= Истина;
	
	Элементы[Маркетплейс + "ЗагрузитьДанныеХранения"].Доступность 	= Ложь;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
&НаКлиенте
Функция ПараметрыОжидания()

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);	
	
	ПараметрыОжидания.ВыводитьОкноОжидания 	= Ложь;
	ПараметрыОжидания.ВыводитьСообщения 	= Истина;
	
	Возврат ПараметрыОжидания;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
&НаСервереБезКонтекста
Функция ЗагрузитьДанныеХраненияНаСервере(Профиль, Период, УникальныйИдентификатор)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	ПараметрыВыполнения.ЗапуститьВФоне 		= Истина;
	ПараметрыВыполнения.ОжидатьЗавершение 	= 0;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ИС_WB_Сервер.СоздатьОтчетПлатногоХранения", Профиль, Период);
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
&НаКлиенте
Процедура ЗагрузитьДанныеХраненияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы[Маркетплейс + "КартинкаОжидание"].Видимость = Ложь;
	Элементы[Маркетплейс + "ЗагрузитьДанныеХранения"].Доступность = Истина;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли; 
	
	ЗагрузитьДанныеПлатногоХранения(Результат.АдресРезультата); 
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
&НаСервере
Процедура ЗагрузитьДанныеПлатногоХранения(Знач Адрес)
	
	taskId = ПолучитьИзВременногоХранилища(Адрес);
	
	Результат = ИС_WB_Сервер.ЗагрузитьОтчетПлатногоХранения(Профиль, taskId);	
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Произошла ошибка при получении данных хранения. Повторите попытку.");
		Возврат;
	КонецЕсли;  
	
	ТаблицаДанныхХранения = Новый ТаблицаЗначений;
	
	ТаблицаДанныхХранения.Колонки.Добавить("РазмерWB", 			Новый ОписаниеТипов("СправочникСсылка.ИС_WB_РазмерыНоменклатур"));
	ТаблицаДанныхХранения.Колонки.Добавить("АртикулWB", 		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,0)));
	ТаблицаДанныхХранения.Колонки.Добавить("Хранение", 			Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,2)));
	ТаблицаДанныхХранения.Колонки.Добавить("ДатаРасчета", 		Новый ОписаниеТипов("Дата",,));
	ТаблицаДанныхХранения.Колонки.Добавить("ДатаПерерасчета", 	Новый ОписаниеТипов("Дата",,));
	
	Для Каждого ЭлементРезультат Из Результат Цикл
		
		НоваяСтрока = ТаблицаДанныхХранения.Добавить();
		
		Если ЭлементРезультат.warehousePrice = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока.РазмерWB 		= Справочники.ИС_WB_РазмерыНоменклатур.НайтиПоКоду(ЭлементРезультат.chrtId);
		НоваяСтрока.АртикулWB 		= ЭлементРезультат.nmId;
		НоваяСтрока.Хранение		= Окр(ЭлементРезультат.warehousePrice, 3, 0);
		НоваяСтрока.ДатаРасчета 	= ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(ЭлементРезультат.date, ФорматДатыJSON.ISO);
		НоваяСтрока.ДатаПерерасчета = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(ЭлементРезультат.originalDate, ФорматДатыJSON.ISO);
		
	КонецЦикла; 
	
	День 			= 60 * 60 * 24;
	ДатаНачала 		= Период.ДатаНачала - День;
	ДатаОкончания 	= Период.ДатаОкончания - День;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеТЗ.РазмерWB КАК РазмерWB,
	|	ДанныеТЗ.АртикулWB КАК АртикулWB,
	|	ДанныеТЗ.Хранение КАК Хранение,
	|	ДанныеТЗ.ДатаРасчета КАК ДатаРасчета,
	|	ДанныеТЗ.ДатаПерерасчета КАК ДатаПерерасчета
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&ТаблицаДанных КАК ДанныеТЗ
	|ГДЕ
	|	ДанныеТЗ.ДатаПерерасчета МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.РазмерWB КАК РазмерWB,
	|	ВТ_Данные.АртикулWB КАК АртикулWB,
	|	ВТ_Данные.Хранение КАК Хранение
	|ПОМЕСТИТЬ ВТ_РасчетСумм
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СгруппированныеДанные.РазмерWB КАК РазмерWB,
	|	ВТ_СгруппированныеДанные.АртикулWB КАК АртикулWB,
	|	СУММА(ВТ_СгруппированныеДанные.Хранение) КАК Хранение
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_РасчетСумм КАК ВТ_СгруппированныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СгруппированныеДанные.РазмерWB,
	|	ВТ_СгруппированныеДанные.АртикулWB
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.РазмерWB КАК РазмерWB,
	|	ВТ_Итог.АртикулWB КАК АртикулWB,
	|	ВТ_Итог.Хранение КАК Хранение
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", 	ТаблицаДанныхХранения);
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ДатаОкончания);
	
	Хранение = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДанныхХранения.Очистить();
	
	Для Каждого ЭлементХранения Из Хранение Цикл
		
		НоваяСтрока = ТаблицаДанныхХранения.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементХранения);
		
	КонецЦикла;
	
	ТаблицаЗначенийРезультирующая = Новый ТаблицаЗначений; 
	
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("НоменклатураWB", 	Новый ОписаниеТипов("СправочникСсылка.ИС_WB_Номенклатура"));			
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("РазмерWB", 			Новый ОписаниеТипов("СправочникСсылка.ИС_WB_РазмерыНоменклатур"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Хранение", 			Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,2)));
	
	Для Каждого Элемент Из ТаблицаДанныхХранения Цикл
		
		НайденныеСтроки = WildBerriesТаблицаДанных.НайтиСтроки(Новый Структура("РазмерWB", Элемент.РазмерWB));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			НоваяСтрока = ТаблицаЗначенийРезультирующая.Добавить();
			
			НоваяСтрока.НоменклатураWB 	= Справочники.ИС_WB_Номенклатура.НайтиПоКоду(Элемент.АртикулWB);
			НоваяСтрока.РазмерWB 		= Элемент.РазмерWB;
			НоваяСтрока.Хранение 		= Элемент.Хранение;
			
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого ЭлементДанных Из НайденныеСтроки Цикл
			
			ЭлементДанных.Хранение = Элемент.Хранение;
			
			Прервать;
			
		КонецЦикла;
		
	КонецЦикла;	 
	
	Для Каждого ЭлементРезультирующая Из ТаблицаЗначенийРезультирующая Цикл
		
		НоваяСтрока = WildBerriesТаблицаДанных.Добавить();
			
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементРезультирующая);
		
	КонецЦикла;
	
	ПодобратьПоРазмеруНаСервере(WildBerriesТаблицаДанных);
	
	РасчетПоказателей();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
&НаСервере
Процедура ЗагрузитьОтчетКомисисонераПоApiНаСервере()
	
	Попытка
	
		ДатаНачала 		= НачалоДня(Период.ДатаНачала);
		ДатаОкончания 	= КонецДня(Период.ДатаОкончания);
		
		ДанныеОК		= ИС_WB_Сервер.ПолучитьДанныеОтчетаКомиссионераApi(Профиль, ДатаНачала, ДатаОкончания); 
		
		Если ДанныеОК.Таблица.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Нет данных для обработки.");
			Возврат;
		КонецЕсли;
		
		НомерРФ = 0;
		
		Если ДанныеОК.Свойство("НомерРФ") Тогда
			НомерРФ = ДанныеОК.НомерРФ;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = ИС_WB_Сервер.ПолучитьТекстЗапросаОтчетаКомиссионера();
		
		Запрос.УстановитьПараметр("ДанныеТЗ", 	ДанныеОК.Таблица);
		Запрос.УстановитьПараметр("Профиль", 	Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ДанныеДляДокумента = РезультатЗапроса.Выгрузить(); 
		
		ДанныеДляДокумента = ПодобратьПоАртикулуНаСервере(ДанныеДляДокумента);
		
		WildBerriesТаблицаДанных.Очистить();
		
		Для Каждого Элемент Из ДанныеДляДокумента Цикл
			
			НоваяСтрока = WildBerriesТаблицаДанных.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
			
			НоваяСтрока.НоменклатураWB 	= Справочники.ИС_WB_Номенклатура.НайтиПоКоду(Элемент.АртикулWB);
				
		КонецЦикла;
	
	Исключение
	 	ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;	
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 12.12.24 УА #67818
&НаСервере
Функция ПодобратьПоРазмеруНаСервере(СписокТранзакций)
	
	ИспользуетсяЦенообразование25 = Константы.ИспользуетсяЦенообразование25.Получить();
	
	РазмерыWB = Новый Массив;
	
	ТаблицаСопоставления = СписокТранзакций;  
		
	Для Каждого Строка Из ТаблицаСопоставления Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			РазмерыWB.Добавить(Строка.РазмерWB);
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(РазмерыWB);
	
	Если РазмерыWB.Количество() = 0 Тогда		
		Возврат ТаблицаСопоставления;		
	КонецЕсли;
		
	Запрос = Новый Запрос;

	Если ИспользуетсяЦенообразование25 Тогда
		
		Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_СоответствиеРазмеров.РазмерWB КАК РазмерWB,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Результирующая
		|ИЗ
		|	РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|ГДЕ
		|	ИС_WB_СоответствиеРазмеров.Профиль = &Профиль
		|	И ИС_WB_СоответствиеРазмеров.РазмерWB В(&РазмерыWB)
		|	И НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Результирующая.РазмерWB КАК РазмерWB,
		|	ВТ_Результирующая.Номенклатура КАК Номенклатура,
		|	ВТ_Результирующая.Характеристика КАК Характеристика
		|ИЗ
		|	ВТ_Результирующая КАК ВТ_Результирующая";
		
	Иначе
		
		Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_СоответствиеРазмеров.РазмерWB КАК РазмерWB,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Результирующая
		|ИЗ
		|	РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|ГДЕ
		|	ИС_WB_СоответствиеРазмеров.Профиль = &Профиль
		|	И ИС_WB_СоответствиеРазмеров.РазмерWB В(&РазмерыWB)
		|	И НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Результирующая.РазмерWB КАК РазмерWB,
		|	ВТ_Результирующая.Номенклатура КАК Номенклатура,
		|	ВТ_Результирующая.Характеристика КАК Характеристика
		|ИЗ
		|	ВТ_Результирующая КАК ВТ_Результирующая";
		
	КонецЕсли;
	
	Запрос.Текст = Текст;
	
	Запрос.УстановитьПараметр("Профиль", 	Профиль);
	Запрос.УстановитьПараметр("РазмерыWB", 	РазмерыWB);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = ТаблицаСопоставления.НайтиСтроки(Новый Структура("РазмерWB", Выборка.РазмерWB));
		
		Для Каждого Элемент Из НайденныеСтроки Цикл
			
			Если Не ЗначениеЗаполнено(Элемент.Номенклатура) Тогда
				
				ЗаполнитьЗначенияСвойств(Элемент, Выборка, "Номенклатура,Характеристика,РазмерWB"); 
					
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	СписокТранзакций.Сортировать("РазмерWB");
	
	Возврат СписокТранзакций;
		
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 12.12.24 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 12.12.24 УА #67818
&НаСервере
Функция ПодобратьПоАртикулуНаСервере(СписокТранзакций)
	
	ИспользуетсяЦенообразование25 = Константы.ИспользуетсяЦенообразование25.Получить();
	
	ТЗРезультирующая = Новый ТаблицаЗначений;
	
	ТЗРезультирующая.Колонки.Добавить("Артикул", 	Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТЗРезультирующая.Колонки.Добавить("Размер", 	Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	
	ТаблицаСопоставления = СписокТранзакций;  
		
	Для Каждого Строка Из ТаблицаСопоставления Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			НоваяСтрока = ТЗРезультирующая.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ТЗРезультирующая.Свернуть("Артикул, Размер");
	
	Если ТЗРезультирующая.Количество() = 0 Тогда		
		Возврат ТаблицаСопоставления;		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	
	Если ИспользуетсяЦенообразование25 Тогда
		
		Текст = 
		"ВЫБРАТЬ
		|	ДанныеТЗ.Артикул КАК Артикул,
		|	ДанныеТЗ.Размер КАК Размер
		|ПОМЕСТИТЬ ВТ_ДанныеТЗ
		|ИЗ
		|	&ТЗРезультирующая КАК ДанныеТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИС_WB_Номенклатура.Ссылка КАК Ссылка,
		|	ВТ_ДанныеТЗ.Артикул КАК Артикул,
		|	ВТ_ДанныеТЗ.Размер КАК Размер
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеТЗ КАК ВТ_ДанныеТЗ
		|		ПО ИС_WB_Номенклатура.vendorCode = ВТ_ДанныеТЗ.Артикул
		|ГДЕ
		|	ИС_WB_Номенклатура.Профиль = &Профиль
		|	И НЕ ВТ_ДанныеТЗ.Размер ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Ссылка КАК НоменклатураWB,
		|	ВТ_Номенклатура.Артикул КАК Артикул,
		|	МАКСИМУМ(ИС_WB_РазмерыНоменклатур.Ссылка) КАК РазмерWB
		|ПОМЕСТИТЬ ВТ_РазмерНоменклатуры
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
		|		ПО (ИС_WB_РазмерыНоменклатур.Владелец = ВТ_Номенклатура.Ссылка)
		|			И (ИС_WB_РазмерыНоменклатур.Профиль = &Профиль)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Номенклатура.Ссылка,
		|	ИС_WB_РазмерыНоменклатур.techSize,
		|	ВТ_Номенклатура.Размер,
		|	ВТ_Номенклатура.Артикул
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РазмерНоменклатуры.Артикул КАК Артикул,
		|	ВТ_РазмерНоменклатуры.РазмерWB КАК РазмерWB,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Результирующая
		|ИЗ
		|	ВТ_РазмерНоменклатуры КАК ВТ_РазмерНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
		|		ПО ВТ_РазмерНоменклатуры.НоменклатураWB = ИС_WB_РазмерыНоменклатур.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО (ИС_WB_РазмерыНоменклатур.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB)
		|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
		|ГДЕ
		|	ИС_WB_РазмерыНоменклатур.Профиль = &Профиль
		|	И НЕ ИС_WB_РазмерыНоменклатур.ПометкаУдаления
		|	И НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Результирующая.Номенклатура КАК Номенклатура,
		|	ВТ_Результирующая.Характеристика КАК Характеристика,
		|	ВТ_Результирующая.Артикул КАК АртикулПоставщика,
		|	ВТ_Результирующая.РазмерWB КАК РазмерWB
		|ИЗ
		|	ВТ_Результирующая КАК ВТ_Результирующая";
		
	Иначе
		
		Текст = 
		"ВЫБРАТЬ
		|	ДанныеТЗ.Артикул КАК Артикул,
		|	ДанныеТЗ.Размер КАК Размер
		|ПОМЕСТИТЬ ВТ_ДанныеТЗ
		|ИЗ
		|	&ТЗРезультирующая КАК ДанныеТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИС_WB_Номенклатура.Ссылка КАК Ссылка,
		|	ВТ_ДанныеТЗ.Артикул КАК Артикул,
		|	ВТ_ДанныеТЗ.Размер КАК Размер
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеТЗ КАК ВТ_ДанныеТЗ
		|		ПО ИС_WB_Номенклатура.vendorCode = ВТ_ДанныеТЗ.Артикул
		|ГДЕ
		|	ИС_WB_Номенклатура.Профиль = &Профиль
		|	И НЕ ВТ_ДанныеТЗ.Размер ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Ссылка КАК НоменклатураWB,
		|	ВТ_Номенклатура.Артикул КАК Артикул,
		|	МАКСИМУМ(ИС_WB_РазмерыНоменклатур.Ссылка) КАК РазмерWB
		|ПОМЕСТИТЬ ВТ_РазмерНоменклатуры
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
		|		ПО (ИС_WB_РазмерыНоменклатур.Владелец = ВТ_Номенклатура.Ссылка)
		|			И (ИС_WB_РазмерыНоменклатур.Профиль = &Профиль)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Номенклатура.Ссылка,
		|	ИС_WB_РазмерыНоменклатур.techSize,
		|	ВТ_Номенклатура.Размер,
		|	ВТ_Номенклатура.Артикул
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РазмерНоменклатуры.Артикул КАК Артикул,
		|	ВТ_РазмерНоменклатуры.РазмерWB КАК РазмерWB,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Результирующая
		|ИЗ
		|	ВТ_РазмерНоменклатуры КАК ВТ_РазмерНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
		|		ПО ВТ_РазмерНоменклатуры.НоменклатураWB = ИС_WB_РазмерыНоменклатур.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО (ИС_WB_РазмерыНоменклатур.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB)
		|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
		|ГДЕ
		|	ИС_WB_РазмерыНоменклатур.Профиль = &Профиль
		|	И НЕ ИС_WB_РазмерыНоменклатур.ПометкаУдаления
		|	И НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Результирующая.Номенклатура КАК Номенклатура,
		|	ВТ_Результирующая.Характеристика КАК Характеристика,
		|	ВТ_Результирующая.Артикул КАК АртикулПоставщика,
		|	ВТ_Результирующая.РазмерWB КАК РазмерWB
		|ИЗ
		|	ВТ_Результирующая КАК ВТ_Результирующая";
		
	КонецЕсли;
	
	Запрос.Текст = Текст;	
	
	Запрос.УстановитьПараметр("Профиль", 			Профиль);
	Запрос.УстановитьПараметр("ТЗРезультирующая", 	ТЗРезультирующая);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = ТаблицаСопоставления.НайтиСтроки(Новый Структура("Артикул", Выборка.АртикулПоставщика));
		
		Для Каждого Элемент Из НайденныеСтроки Цикл
			
			Если Не ЗначениеЗаполнено(Элемент.Номенклатура) Тогда
				
				ЗаполнитьЗначенияСвойств(Элемент, Выборка, "Номенклатура,Характеристика,РазмерWB"); 
					
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	СписокТранзакций.Сортировать("РазмерWB");
	
	Возврат СписокТранзакций;
		
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 12.12.24 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130
&НаСервере
Процедура РасчетСреднейВзвешеннойЦеныНаСервере()
	
	ТаблицаДанныеЦенРасчета = Новый ТаблицаЗначений;

	ТаблицаДанныеЦенРасчета.Колонки.Добавить("НоменклатураWB", 		Новый ОписаниеТипов("СправочникСсылка.ИС_WB_Номенклатура"));			
	ТаблицаДанныеЦенРасчета.Колонки.Добавить("РазмерWB", 			Новый ОписаниеТипов("СправочникСсылка.ИС_WB_РазмерыНоменклатур"));
	ТаблицаДанныеЦенРасчета.Колонки.Добавить("Номенклатура", 		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));			
	ТаблицаДанныеЦенРасчета.Колонки.Добавить("Характеристика", 		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатурыДляЦенообразования, СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДанныеЦенРасчета.Колонки.Добавить("Количество", 			Новый ОписаниеТипов("Число"));
	ТаблицаДанныеЦенРасчета.Колонки.Добавить("ЦенаПередачи", 		Новый ОписаниеТипов("Число"));

	Для Каждого Элемент Из WildBerriesТаблицаДанных Цикл
		
		Если Элемент.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаДанныеЦенРасчета.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		
	КонецЦикла;	

	Запрос = Новый Запрос;
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ВТ_Данные.РазмерWB КАК РазмерWB,
	|	ВТ_Данные.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	|	ВТ_Данные.Количество КАК Количество,
	|	ВТ_Данные.ЦенаПередачи КАК ЦенаПередачи
	|ПОМЕСТИТЬ ВТ_ДанныеИтог
	|ИЗ
	|	&ТаблицаДанныеРасчета КАК ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИтог.РазмерWB КАК РазмерWB,
	|	ВТ_ДанныеИтог.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_ДанныеИтог.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеИтог.Характеристика КАК Характеристика,
	|	ВТ_ДанныеИтог.Количество КАК Количество,
	|	ВТ_ДанныеИтог.ЦенаПередачи КАК ЦенаПередачи
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_ДанныеИтог КАК ВТ_ДанныеИтог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.РазмерWB КАК РазмерWB,
	|	ВТ_Итог.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_Итог.Номенклатура КАК Номенклатура,
	|	ВТ_Итог.Характеристика КАК Характеристика,
	|	ВТ_Итог.Количество КАК Количество,
	|	ВТ_Итог.ЦенаПередачи КАК ЦенаПередачи,
	|	NULL КАК ОбщееКоличество
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|ИТОГИ
	|	КОЛИЧЕСТВО(ВТ_Итог.РазмерWB) КАК ОбщееКоличество 
	|ПО
	|	РазмерWB";
		
	Запрос.УстановитьПараметр("ТаблицаДанныеРасчета", ТаблицаДанныеЦенРасчета);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаЦен = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	Пока ВыборкаЦен.Следующий() Цикл
		
		ЦенаПередачи 	= 0;
		ОбщееКоличество = ВыборкаЦен.ОбщееКоличество;
		
		Выборка = ВыборкаЦен.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЦенаПередачи = ЦенаПередачи + Выборка.ЦенаПередачи * Выборка.Количество;	
		КонецЦикла;
		
		ЦенаПередачи = ЦенаПередачи / ОбщееКоличество;
		
		Если ЦенаПередачи = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = WildBerriesТаблицаДанных.НайтиСтроки(Новый Структура("РазмерWB", ВыборкаЦен.РазмерWB));
		
		Для Каждого Элемент Из НайденныеСтроки Цикл
			Элемент.ЦенаПередачи = ЦенаПередачи;	
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130

//+ ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130 
&НаСервере
Процедура СгруппироватьДанныеНаСервере()

	ТаблицаДанныеРасчета = Новый ТаблицаЗначений;

	ТаблицаДанныеРасчета.Колонки.Добавить("ЗаказМП", 				Новый ОписаниеТипов("ДокументСсылка.ИС_WB_СборочноеЗадание"));
	ТаблицаДанныеРасчета.Колонки.Добавить("НоменклатураWB", 		Новый ОписаниеТипов("СправочникСсылка.ИС_WB_Номенклатура"));			
	ТаблицаДанныеРасчета.Колонки.Добавить("РазмерWB", 				Новый ОписаниеТипов("СправочникСсылка.ИС_WB_РазмерыНоменклатур"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));			
	ТаблицаДанныеРасчета.Колонки.Добавить("Характеристика", 		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатурыДляЦенообразования, СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Количество", 			Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Комиссия", 				Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Хранение", 				Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Логистика", 				Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Штрафы", 				Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("ЦенаПередачи", 			Новый ОписаниеТипов("Число"));

	Для Каждого Элемент Из WildBerriesТаблицаДанных Цикл
		
		НоваяСтрока = ТаблицаДанныеРасчета.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Текст =
	"ВЫБРАТЬ
	|	ВТ_Данные.ЗаказМП КАК ЗаказМП,
	|	ВТ_Данные.РазмерWB КАК РазмерWB,
	|	ВТ_Данные.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	|	ВТ_Данные.Количество КАК Количество,
	|	ВТ_Данные.ЦенаПередачи КАК ЦенаПередачи,
	|	ВТ_Данные.Комиссия КАК Комиссия,
	|	ВТ_Данные.Логистика КАК Логистика,
	|	ВТ_Данные.Штрафы КАК Штрафы,
	|	ВТ_Данные.Хранение КАК Хранение
	|ПОМЕСТИТЬ ВТ_ДанныеИтог
	|ИЗ
	|	&ТаблицаДанныеРасчета КАК ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИтог.ЗаказМП КАК ЗаказМП,
	|	ВТ_ДанныеИтог.РазмерWB КАК РазмерWB,
	|	ВТ_ДанныеИтог.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_ДанныеИтог.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеИтог.Характеристика КАК Характеристика,
	|	ВТ_ДанныеИтог.ЦенаПередачи КАК ЦенаПередачи,
	|	СУММА(ВТ_ДанныеИтог.Количество) КАК Количество,
	|	СУММА(ВТ_ДанныеИтог.Комиссия) КАК Комиссия,
	|	СУММА(ВТ_ДанныеИтог.Логистика) КАК Логистика,
	|	СУММА(ВТ_ДанныеИтог.Штрафы) КАК Штрафы,
	|	СУММА(ВТ_ДанныеИтог.Хранение) КАК Хранение
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_ДанныеИтог КАК ВТ_ДанныеИтог
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеИтог.ЗаказМП,
	|	ВТ_ДанныеИтог.РазмерWB,
	|	ВТ_ДанныеИтог.НоменклатураWB,
	|	ВТ_ДанныеИтог.Номенклатура,
	|	ВТ_ДанныеИтог.Характеристика,
	|	ВТ_ДанныеИтог.ЦенаПередачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.ЗаказМП КАК ЗаказМП,
	|	ВТ_Итог.РазмерWB КАК РазмерWB,
	|	ВТ_Итог.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_Итог.Номенклатура КАК Номенклатура,
	|	ВТ_Итог.Характеристика КАК Характеристика,
	|	ВТ_Итог.Количество КАК Количество,
	|	ВТ_Итог.ЦенаПередачи КАК ЦенаПередачи,
	|	ВТ_Итог.Комиссия КАК Комиссия,
	|	ВТ_Итог.Логистика КАК Логистика,
	|	ВТ_Итог.Штрафы КАК Штрафы,
	|	ВТ_Итог.Хранение КАК Хранение
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазмерWB";
	
	Запрос.Текст = Текст;
	
	Запрос.УстановитьПараметр("ТаблицаДанныеРасчета", ТаблицаДанныеРасчета);
	
	Данные = Запрос.Выполнить().Выгрузить();
		
	WildBerriesТаблицаДанных.Очистить();
	
	Для Каждого Элемент Из Данные Цикл
		
		НоваяСтрока = WildBerriesТаблицаДанных.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130

//+ ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130 
&НаСервере
Процедура РасчетПоказателей()
	
	ТаблицаДанныеРасчета = Новый ТаблицаЗначений;

	ТаблицаДанныеРасчета.Колонки.Добавить("ЗаказМП", 				Новый ОписаниеТипов("ДокументСсылка.ИС_WB_СборочноеЗадание"));
	ТаблицаДанныеРасчета.Колонки.Добавить("НоменклатураWB", 		Новый ОписаниеТипов("СправочникСсылка.ИС_WB_Номенклатура"));			
	ТаблицаДанныеРасчета.Колонки.Добавить("РазмерWB", 				Новый ОписаниеТипов("СправочникСсылка.ИС_WB_РазмерыНоменклатур"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));			
	ТаблицаДанныеРасчета.Колонки.Добавить("Характеристика", 		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатурыДляЦенообразования, СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Количество", 			Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Комиссия", 				Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Хранение", 				Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Логистика", 				Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Штрафы", 				Новый ОписаниеТипов("Число")); 
	ТаблицаДанныеРасчета.Колонки.Добавить("ПрочиеРасходы", 			Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("ЦенаПередачи", 			Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("ЗакупочнаяЦена",			Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Себестоимость", 			Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("МаржинальнаяПрибыль", 	Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("МаржинальностьПроцент", 	Новый ОписаниеТипов("Число"));
	ТаблицаДанныеРасчета.Колонки.Добавить("Выручка", 				Новый ОписаниеТипов("Число"));

	Для Каждого Элемент Из WildBerriesТаблицаДанных Цикл
		
		НоваяСтрока = ТаблицаДанныеРасчета.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		
	КонецЦикла;	
	
	МассивПараметров 				= ИС_WB_Сервер.ПолучитьСписокПараметровЦен();
	
	Результат 						= ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, МассивПараметров);
	
	СтруктураЦен 					= ИС_WB_Сервер.ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	
	ВидЦеныЗакупочная 				= СтруктураЦен.ВидЦеныЗакупочная;
	
	ИспользуетсяЦенообразование25 	= Константы.ИспользуетсяЦенообразование25.Получить();
	
	РазделительЗапрос 				= ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Запрос = Новый Запрос;
	
	Текст =
	"ВЫБРАТЬ
	|	ВТ_Данные.ЗаказМП КАК ЗаказМП,
	|	ВТ_Данные.РазмерWB КАК РазмерWB,
	|	ВТ_Данные.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	|	ВТ_Данные.Количество КАК Количество,
	|	ВТ_Данные.ЦенаПередачи КАК ЦенаПередачи,
	|	ВТ_Данные.Комиссия КАК Комиссия,
	|	ВТ_Данные.Логистика КАК Логистика,
	|	ВТ_Данные.Штрафы КАК Штрафы,
	|	ВТ_Данные.Хранение КАК Хранение,
	|	ВТ_Данные.ПрочиеРасходы КАК ПрочиеРасходы
	|ПОМЕСТИТЬ ВТ_ДанныеИтог
	|ИЗ
	|	&ТаблицаДанныеРасчета КАК ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИтог.ЗаказМП КАК ЗаказМП,
	|	ВТ_ДанныеИтог.РазмерWB КАК РазмерWB,
	|	ВТ_ДанныеИтог.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_ДанныеИтог.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеИтог.Характеристика КАК Характеристика,
	|	ВТ_ДанныеИтог.Количество КАК Количество,
	|	ВТ_ДанныеИтог.ЦенаПередачи КАК ЦенаПередачи,
	|	ВТ_ДанныеИтог.Комиссия КАК Комиссия,
	|	ВТ_ДанныеИтог.Логистика КАК Логистика,
	|	ВТ_ДанныеИтог.Штрафы КАК Штрафы,
	|	ВТ_ДанныеИтог.Хранение КАК Хранение,
	|	ВТ_ДанныеИтог.ПрочиеРасходы КАК ПрочиеРасходы
	|ПОМЕСТИТЬ ВТ_ПоказателиОбъединение
	|ИЗ
	|	ВТ_ДанныеИтог КАК ВТ_ДанныеИтог";
	
	Если ИспользуетсяЦенообразование25 Тогда
		
		Текст = Текст + РазделительЗапрос +
		
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры25.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры25.ХарактеристикаЦО КАК Характеристика,
		|	ЕСТЬNULL(ЦеныНоменклатуры25.Цена, 0) КАК Себестоимость
		|ПОМЕСТИТЬ ВТ_Себестоимость
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		|			,
		|			ВидЦены = &ВидЦены
		|				И (Номенклатура, ХарактеристикаЦО) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура КАК Номенклатура,
		|						ВТ.Характеристика КАК ХарактеристикаЦО	
		|					ИЗ
		|						ВТ_ПоказателиОбъединение КАК ВТ)) КАК ЦеныНоменклатуры25";
		
		
	Иначе 
		
		Текст = Текст + РазделительЗапрос +
		
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Себестоимость
		|ПОМЕСТИТЬ ВТ_Себестоимость
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			ВидЦены = &ВидЦены
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура КАК Номенклатура,
		|						ВТ.Характеристика КАК Характеристика
		|					ИЗ
		|						ВТ_ПоказателиОбъединение КАК ВТ)) КАК ЦеныНоменклатуры";
		
	КонецЕсли;

	Текст = Текст + РазделительЗапрос +
	
	"ВЫБРАТЬ
	|	ВТ_ПоказателиОбъединение.ЗаказМП КАК ЗаказМП,
	|	ВТ_ПоказателиОбъединение.РазмерWB КАК РазмерWB,
	|	ВТ_ПоказателиОбъединение.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_ПоказателиОбъединение.Номенклатура КАК Номенклатура,
	|	ВТ_ПоказателиОбъединение.Характеристика КАК Характеристика,
	|	ВТ_ПоказателиОбъединение.Количество КАК Количество,
	|	ВТ_ПоказателиОбъединение.ЦенаПередачи КАК ЦенаПередачи,
	|	ВТ_ПоказателиОбъединение.Комиссия КАК Комиссия,
	|	ВТ_ПоказателиОбъединение.Логистика КАК Логистика,
	|	ВТ_ПоказателиОбъединение.Штрафы КАК Штрафы,
	|	ВТ_ПоказателиОбъединение.Хранение КАК Хранение,
	|	ВТ_ПоказателиОбъединение.ПрочиеРасходы КАК ПрочиеРасходы,	
	|	ЕСТЬNULL(ВТ_Себестоимость.Себестоимость, 0) КАК ЗакупочнаяЦена,
	|	ЕСТЬNULL(ВТ_Себестоимость.Себестоимость, 0) КАК Себестоимость
	|ПОМЕСТИТЬ ВТ_Показатели
	|ИЗ
	|	ВТ_ПоказателиОбъединение КАК ВТ_ПоказателиОбъединение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Себестоимость КАК ВТ_Себестоимость
	|		ПО ВТ_ПоказателиОбъединение.Номенклатура = ВТ_Себестоимость.Номенклатура
	|			И (ВТ_ПоказателиОбъединение.Характеристика = ВТ_ПоказателиОбъединение.Характеристика)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Показатели.ЗаказМП КАК ЗаказМП,
	|	ВТ_Показатели.РазмерWB КАК РазмерWB,
	|	ВТ_Показатели.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_Показатели.Номенклатура КАК Номенклатура,
	|	ВТ_Показатели.Характеристика КАК Характеристика,
	|	ВТ_Показатели.Себестоимость КАК Себестоимость,
	|	ВТ_Показатели.ЗакупочнаяЦена КАК ЗакупочнаяЦена,
	|	ВТ_Показатели.ЦенаПередачи КАК ЦенаПередачи,
	|	СУММА(ВТ_Показатели.Количество) КАК Количество,
	|	СУММА(ВТ_Показатели.Комиссия) КАК Комиссия,
	|	СУММА(ВТ_Показатели.Логистика) КАК Логистика,
	|	СУММА(ВТ_Показатели.Штрафы) КАК Штрафы,
	|	СУММА(ВТ_Показатели.Хранение) КАК Хранение,
	|	СУММА(ВТ_Показатели.ПрочиеРасходы) КАК ПрочиеРасходы	
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_Показатели КАК ВТ_Показатели
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Показатели.ЗаказМП,
	|	ВТ_Показатели.РазмерWB,
	|	ВТ_Показатели.НоменклатураWB,
	|	ВТ_Показатели.Номенклатура,
	|	ВТ_Показатели.Характеристика,
	|	ВТ_Показатели.Себестоимость,
	|	ВТ_Показатели.ЗакупочнаяЦена,
	|	ВТ_Показатели.ЦенаПередачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.ЗаказМП КАК ЗаказМП,
	|	ВТ_Итог.РазмерWB КАК РазмерWB,
	|	ВТ_Итог.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_Итог.Номенклатура КАК Номенклатура,
	|	ВТ_Итог.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ВТ_Итог.Количество = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_Итог.Количество
	|	КОНЕЦ КАК Количество,
	|	ВТ_Итог.ЦенаПередачи КАК ЦенаПередачи,
	|	ВТ_Итог.Себестоимость КАК Себестоимость,
	|	ВТ_Итог.ЗакупочнаяЦена КАК ЗакупочнаяЦена,
	|	ВТ_Итог.Комиссия КАК Комиссия,
	|	ВТ_Итог.Логистика КАК Логистика,
	|	ВТ_Итог.Штрафы КАК Штрафы,
	|	ВТ_Итог.Хранение КАК Хранение,
	|	ВТ_Итог.ПрочиеРасходы КАК ПрочиеРасходы
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог";
	
	Запрос.Текст = Текст;
	
	Запрос.УстановитьПараметр("ВидЦены", 				ВидЦеныЗакупочная);
	Запрос.УстановитьПараметр("ТаблицаДанныеРасчета", 	ТаблицаДанныеРасчета);
	
	Данные = Запрос.Выполнить().Выгрузить();
		
	WildBerriesТаблицаДанных.Очистить();
	
	Для Каждого Элемент Из Данные Цикл
		
		НоваяСтрока = WildBerriesТаблицаДанных.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		
		Расходы = НоваяСтрока.Комиссия + НоваяСтрока.Логистика + НоваяСтрока.Хранение + НоваяСтрока.Штрафы + НоваяСтрока.ПрочиеРасходы;
		Выручка = НоваяСтрока.ЦенаПередачи * НоваяСтрока.Количество;
		
		НоваяСтрока.Себестоимость 			= НоваяСтрока.ЗакупочнаяЦена + Расходы;
		НоваяСтрока.Выручка 				= Выручка;
		НоваяСтрока.МаржинальнаяПрибыль 	= Выручка - НоваяСтрока.Себестоимость;
		
		Если НоваяСтрока.ЦенаПередачи = 0 Тогда
			НоваяСтрока.МаржинальностьПроцент = (Выручка - Расходы) / 100;
		ИначеЕсли НоваяСтрока.Количество = 0 Тогда 
			НоваяСтрока.МаржинальностьПроцент = (Выручка - Расходы) / 100;	
		Иначе
			НоваяСтрока.МаржинальностьПроцент = (Выручка - Расходы) / Выручка * 100;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130

//+ ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130
&НаКлиенте
Процедура РасчетПоказетелейСтрокиНаКлиенте(Строка)

	Расходы = Строка.Комиссия + Строка.Логистика + Строка.Хранение + Строка.Штрафы + Строка.ПрочиеРасходы;
	Выручка = Строка.ЦенаПередачи * Строка.Количество;
	
	Строка.Себестоимость 		= Строка.ЗакупочнаяЦена + Расходы;
	Строка.Выручка 				= Выручка;
	Строка.МаржинальнаяПрибыль 	= Выручка - Строка.Себестоимость;
	
	Если Строка.ЦенаПередачи = 0 Тогда
		Строка.МаржинальностьПроцент = (Выручка - Расходы) / 100;
	ИначеЕсли Строка.Количество = 0 Тогда 
		Строка.МаржинальностьПроцент = (Выручка - Расходы) / 100;	
	Иначе
		Строка.МаржинальностьПроцент = (Выручка - Расходы) / Выручка * 100;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130

#КонецОбласти
